# Pandas DataFrame Tutorial

This notebook covers essential operations and concepts for working with pandas DataFrames.

## Table of Contents
1. [Importing pandas and creating DataFrames](#1.-Importing-pandas-and-creating-DataFrames)
2. [Basic DataFrame operations](#2.-Basic-DataFrame-operations)
3. [Indexing and selection](#3.-Indexing-and-selection)
4. [Handling missing data](#4.-Handling-missing-data)
5. [Data manipulation](#5.-Data-manipulation)
6. [Grouping and aggregation](#6.-Grouping-and-aggregation)
7. [Merging and joining DataFrames](#7.-Merging-and-joining-DataFrames)
8. [Basic data visualization](#8.-Basic-data-visualization)

## 1. Importing pandas and creating DataFrames

In [1]:
import pandas as pd
import numpy as np

# Creating a DataFrame from a dictionary
data = {
    'Name': ['Rami', 'Osama', 'Nael', 'Yara'],
    'cash': [25, 30, 35, 28],
    'birthdate': ['1990-01-01', '1951-02-02', '1892-03-03', '1970-04-04']
}
df = pd.DataFrame(data)
print(df)

    Name  cash   birthdate
0   Rami    25  1990-01-01
1  Osama    30  1951-02-02
2   Nael    35  1892-03-03
3   Yara    28  1970-04-04

## 2. Basic DataFrame operations

In [ ]:
# Display basic information about the DataFrame

In [ ]:
# Display summary statistics

In [ ]:
# Display the first few rows

In [ ]:
# Display the last few rows

In [ ]:
# Get column names

In [ ]:
# Get data types of columns

In [ ]:
# fix date

## 3. Indexing and selection

In [ ]:
# Select a single column

In [ ]:
# Select multiple columns

In [ ]:
# Select rows by index

In [ ]:
# Select rows by condition

In [ ]:
# Select specific rows and columns

## 4. Handling missing data

In [2]:
# Create a DataFrame with missing values
df_missing = pd.DataFrame({
    'A': [1, 2, np.nan, 4],
    'B': [5, np.nan, np.nan, 8],
    'C': [9, 10, 11, 12]
})

df_missing

     A    B   C
0  1.0  5.0   9
1  2.0  NaN  10
2  NaN  NaN  11
3  4.0  8.0  12

In [ ]:
# Check for missing values

In [ ]:
# Drop rows with missing values

In [ ]:
# Fill missing values

## 5. Data manipulation

In [3]:
# Add a new column
df['Country'] = ['JOR', 'JOR', 'JOR', 'JOR']
df

    Name  cash   birthdate Country
0   Rami    25  1990-01-01     JOR
1  Osama    30  1951-02-02     JOR
2   Nael    35  1892-03-03     JOR
3   Yara    28  1970-04-04     JOR

In [ ]:
# Rename columns

In [ ]:
# Sort DataFrame

In [ ]:
# Apply a function to a column

## 6. Grouping and aggregation

In [4]:
# Create a larger DataFrame for grouping
df_large = pd.DataFrame({
    'Category': ['red ball', 'blue ball', 'red ball', 'blue ball', 'red ball', 'blue ball'],
    'Value': [10, 21, 13, 34, 18, 27]
})
df_large

    Category  Value
0   red ball     10
1  blue ball     21
2   red ball     13
3  blue ball     34
4   red ball     18
5  blue ball     27

In [ ]:
# Group by category and calculate sum

In [ ]:
# Group by category and calculate multiple aggregations

## 7. Merging and joining DataFrames

In [5]:
# Create two DataFrames to merge
df1 = pd.DataFrame({'ID': [1, 2, 3, 4], 'Name': ['Osama', 'Yara', 'Nael', 'Rami']})
df2 = pd.DataFrame({'ID': [2, 3, 4, 5], 'Salary': [50000, 60000, 70000, 80000]})

display(df1)
display(df2)

   ID   Name
0   1  Osama
1   2   Yara
2   3   Nael
3   4   Rami

   ID  Salary
0   2   50000
1   3   60000
2   4   70000
3   5   80000

In [ ]:
# Perform an inner join

In [ ]:
# Perform a left join

In [ ]:
# Concatenate DataFrames

## 8. Basic data visualization

In [6]:
import plotly.express as px

df_large = pd.DataFrame({
    'Category': ['red ball', 'blue ball', 'red ball', 'blue ball', 'red ball', 'blue ball'],
    'Value': [10, 21, 13, 34, 18, 27]
})
df_large

    Category  Value
0   red ball     10
1  blue ball     21
2   red ball     13
3  blue ball     34
4   red ball     18
5  blue ball     27

In [ ]:
# Create a bar chart

In [ ]:
# create pie chart

In [ ]:
# Create a histogram